In [21]:
import pandas as pd
import numpy as np
import json

s=pd.Series(['0', 'John Wood', 'Colin Welsh', 'my list', '02456', np.nan, 'HELLO WORLD', 'water%'])

In [4]:
s.str.split(' ', expand=True)

        0      1
0       0   None
1    John   Wood
2   Colin  Welsh
3      my   list
4   02456   None
5     NaN   None
6   HELLO  WORLD
7  water%   None

In [6]:
s.str.replace('%',' percent ')

0                 0
1         John Wood
2       Colin Welsh
3           my list
4             02456
5               NaN
6       HELLO WORLD
7    water percent
dtype: object

In [7]:
s.str[0:2]

0      0
1     Jo
2     Co
3     my
4     02
5    NaN
6     HE
7     wa
dtype: object

In [8]:
flag = s.str.contains('0')
flag

0     True
1    False
2    False
3    False
4     True
5      NaN
6    False
7    False
dtype: object

In [9]:
flag = s.str.contains('0', na=False)
flag

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
dtype: bool

In [10]:
movies = pd.read_csv('tmdb_5000_movies.csv')
movies.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466
3,250000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 80, ""nam...",http://www.thedarkknightrises.com/,49026,"[{""id"": 849, ""name"": ""dc comics""}, {""id"": 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.312950,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-07-16,1084939099,165.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The Legend Ends,The Dark Knight Rises,7.6,9106
4,260000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://movies.disney.com/john-carter,49529,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,John Carter,"John Carter is a war-weary, former military ca...",43.926995,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-03-07,284139100,132.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"Lost in our world, found in another.",John Carter,6.1,2124

In [23]:
genres=movies.genres

In [14]:
genres[0]

'[{"id": 28, "name": "Action"}, {"id": 12, "name": "Adventure"}, {"id": 14, "name": "Fantasy"}, {"id": 878, "name": "Science Fiction"}]'

In [18]:
def transform(s):
    s=s.str.strip('[]')
    s=s.str.replace('{','')
    s=s.str.replace('}','')
    s=s.str.replace(',','')
    s=s.str.replace('\"id\":','')
    s=s.str.replace('\"name\":','')
    s=s.str.replace('"','')
    return s

In [19]:
genres= transform(genres)
genres[0]

' 28  Action  12  Adventure  14  Fantasy  878  Science Fiction'

In [24]:
def transform(s):
    return [object['name'] for object in json.loads(s)]

transform(genres[0])

['Action', 'Adventure', 'Fantasy', 'Science Fiction']

In [44]:
for object in json.loads(genres[0]):
    print(object)

{'id': 28, 'name': 'Action'}
{'id': 12, 'name': 'Adventure'}
{'id': 14, 'name': 'Fantasy'}
{'id': 878, 'name': 'Science Fiction'}

In [50]:
keywords = []
for object in json.loads(movies.keywords[0]):
    keywords.append(object['name'])
keywords

['culture clash',
 'future',
 'space war',
 'space colony',
 'society',
 'space travel',
 'futuristic',
 'romance',
 'space',
 'alien',
 'tribe',
 'alien planet',
 'cgi',
 'marine',
 'soldier',
 'battle',
 'love affair',
 'anti war',
 'power relations',
 'mind and soul',
 '3d']

In [53]:
', '.join(keywords)

'culture clash, future, space war, space colony, society, space travel, futuristic, romance, space, alien, tribe, alien planet, cgi, marine, soldier, battle, love affair, anti war, power relations, mind and soul, 3d'

In [57]:
s.str.contains('John|Colin', na=False)

0    False
1     True
2     True
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [59]:
s2 = pd.Series(['bar', 'sugar', 'cartoon', 'argon'])
s2

0        bar
1      sugar
2    cartoon
3      argon
dtype: object

In [60]:
s2.str.contains('.ar')

0     True
1     True
2     True
3    False
dtype: bool

In [65]:
s2.str.contains('^ar|[bc]ar')

0     True
1    False
2     True
3     True
dtype: bool

In [78]:
s2.str.contains('[^b]ar$')

0    False
1     True
2    False
3    False
dtype: bool

In [79]:
s3= pd.Series(['forest', 'o', 'ff', 'foo', 'fof'])
s3.str.contains('f+o?f+')

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [82]:
s4= pd.Series(['Monday5km', 'Wednesday10km', 'Saturday25km'])
s4

0        Monday5km
1    Wednesday10km
2     Saturday25km
dtype: object

In [90]:
s4.str.extract('(\w+day)',expand=True)

           0
0     Monday
1  Wednesday
2   Saturday

In [91]:
s4.str.extract('(\wday)',expand=True)

      0
0  nday
1  sday
2  rday

In [98]:
s4[0][:3]

'Mon'

In [160]:
def f(x):
    return x[0][:3]

In [132]:
s4.str.replace('(\w+day)', f)

0     Mon5km
1    Wed10km
2    Sat25km
dtype: object

In [133]:
meal_plan = ['Monday: 9:12am – Omelet,  3:30pm– Apple slices with almond butter', 
             'Tuesday: 9:35am – Banana bread, 11:00am –Sauteed veggies, 7:02pm– Taco pie',
             'Wednesday: 9:00am – Banana pancakes',  
             'Thursday: 7:23pm– Slow cooker pulled pork', 'Friday: 3:30pm – Can of tuna', 
             'Saturday: 9:11am: Eggs and sweet potato hash browns, 3:22pm: Almonds', 
             'Sunday: 11:00am: Meat and veggie stir fry']

In [252]:
df = pd.DataFrame(meal_plan, columns=['text'])
df

                                                text
0  Monday: 9:12am – Omelet,  3:30pm– Apple slices...
1  Tuesday: 9:35am – Banana bread, 11:00am –Saute...
2                Wednesday: 9:00am – Banana pancakes
3          Thursday: 7:23pm– Slow cooker pulled pork
4                       Friday: 3:30pm – Can of tuna
5  Saturday: 9:11am: Eggs and sweet potato hash b...
6          Sunday: 11:00am: Meat and veggie stir fry

In [270]:
res = df.text.str.extractall('([0-9]+):([0-9]+)(\w{2})')
res

          0   1   2
  match
0 0       9  12  am
  1       3  30  pm
1 0       9  35  am
  1      11  00  am
  2       7  02  pm
2 0       9  00  am
3 0       7  23  pm
4 0       3  30  pm
5 0       9  11  am
  1       3  22  pm
6 0      11  00  am

In [285]:
df.text.str.extractall('([0-9]+:[0-9]+\w{2})')

               0
  match
0 0       9:12am
  1       3:30pm
1 0       9:35am
  1      11:00am
  2       7:02pm
2 0       9:00am
3 0       7:23pm
4 0       3:30pm
5 0       9:11am
  1       3:22pm
6 0      11:00am

In [271]:
res.index

MultiIndex(levels=[[0, 1, 2, 3, 4, 5, 6], [0, 1, 2]],
           labels=[[0, 0, 1, 1, 1, 2, 3, 4, 5, 5, 6], [0, 1, 0, 1, 2, 0, 0, 0, 0, 1, 0]],
           names=[None, 'match'])

In [273]:
res.index.set_levels([['Mon', 'Tue', 'Wes', 'Thu', 'Fri', 'Sat', 'Sun'],['breakfast', 'lunch', 'dinner']], inplace=True)

In [276]:
res.columns = ['Hour', 'Minutes', 'Period']

In [277]:
res

              Hour Minutes Period
    match
Mon breakfast    9      12     am
    lunch        3      30     pm
Tue breakfast    9      35     am
    lunch       11      00     am
    dinner       7      02     pm
Wes breakfast    9      00     am
Thu breakfast    7      23     pm
Fri breakfast    3      30     pm
Sat breakfast    9      11     am
    lunch        3      22     pm
Sun breakfast   11      00     am